#!/usr/bin/env python3
"""
MicroSynViz: Visualizing Pairwise Genomic Microsynteny Within and Between Species
Author: Yiyong Zhao (yiyong.zhao@yale.edu)
"""

import sys
from microsynviz import __version__

LOGO = r"""
###############################################################################################
 ███╗   ███╗██╗ ██████╗██████╗  ██████╗ ███████╗██╗   ██╗███╗   ██╗██╗   ██╗██╗███████╗
 ████╗ ████║██║██╔════╝██╔══██╗██╔═══██╗██╔════╝╚██╗ ██╔╝████╗  ██║██║   ██║██║╚══███╔╝
 ██╔████╔██║██║██║     ██████╔╝██║   ██║███████╗ ╚████╔╝ ██╔██╗ ██║██║   ██║██║  ███╔╝
 ██║╚██╔╝██║██║██║     ██╔══██╗██║   ██║╚════██║  ╚██╔╝  ██║╚██╗██║╚██╗ ██╔╝██║ ███╔╝
 ██║ ╚═╝ ██║██║╚██████╗██║  ██║╚██████╔╝███████║   ██║   ██║ ╚████║ ╚████╔╝ ██║███████╗
 ╚═╝     ╚═╝╚═╝ ╚═════╝╚═╝  ╚═╝ ╚═════╝╚══════╝   ╚═╝   ╚═╝  ╚═══╝  ╚═══╝  ╚═╝╚══════╝
###############################################################################################
MicroSynViz: Visualizing Pairwise Genomic Microsynteny Within and Between Species
GitHub:  https://github.com/YiyongZhao/MicroSynViz
Contact: yiyong.zhao@yale.edu
"""

def main():
    if '--version' in sys.argv:
        print(LOGO)
        print(f"MicroSynViz {__version__}")
        return
    if len(sys.argv) == 1 or '--help' in sys.argv or '-h' in sys.argv:
        print(LOGO)
    from microsynviz.core import main as core_main
    core_main()

if __name__ == "__main__":
    main()
